//開発の流れ
//1.ソースコード作成
//2.コンパイル
//3.実行
//
//1.ソースコード作成…
//コンピュータへの指示書。人が読める状態のことを「ソースコード」という。
//ソースコードをを書き込んだファイルを「ソースファイル」。ファイル名＋.javeの「.java」を拡張子という。
//
//2.コンパイル…
//ソースコードはそのままでは実行できない。「compile（コンパイル）」処理を行い、ソースファイルを「.class」ファイルに変換。
//ソースコード(「.class」ファイルに変換したもの。)をコンピュータが実行しやすいようにbytecodeされる。（人は読めない。）
//コンパイルはコンパイラというソフトが実行する。その際に文法チェックが行われ誤りがあれば失敗。訂正の指摘が入る。
//
//3.実行
//interpreter(インタプリタ)というソフトを使用しバイトコードの変更と実行を行う。
//インタプリタ内にはJVM(java virtual machine)という仕組みがありCPUが解釈できるマシーンコードに変更し実行する。
//
//ソースコード
//↓ コンパイル(.classファイルになる)
//バイトコード
//↓ インタプリタがJVMを実行
//マシーンコードに変更。CPUがソースコードを実行。
//

