//Javaプログラムの書き始め方
//
//①どのようなプログラムを作るか？
//②プログラムの名前（＝クラス名）を決める。
//③クラス名.javaでファイルを作る。
//④ソースコードの外側部分を記述する。
//⑤ソースコードの内側部分（命令文）を記述する。
//
//例）
//①日記のプログラムを作る。
//②名前は MyDiary にする。
//③MyDiary.java
//④  public class MyDiary {
//⑤  public static void main(String[] args) {
//     System.out.println("日記ソフト");
//     System.out.println("終了します");
//     }
//    }
//
//
//ポイント１）正確な記述
//・英数字は基本的に半角で入力、大文字、小文字の違いも意識する。
//・オー（o,O）とゼロ(0)、数字のイチ(1)とエル(l)、セミコロン(;)とコロン(:)、カンマ(,)とピリオド(.)間違えないように
//・カッコ( (),{},[] )や引用符( '' , "" )の種類も間違えないように
//
//ポイント２）「上から下」ではなく「外から内」へ
//プログラムを書くときに閉じカッコの数に注意。
//漏れがないように一行ずつ書き閉じカッコの前で改行するように。
//カッコは必ず開いた数だけ閉じられる。
//
//ポイント３）読みやすいコードを記述する。
//人が読みにくい煩雑なコード、複雑で内容の理解に時間のかかるコードでは読みづらい。
//…インデントとコメントを利用する。
//

