//プログラムの骨格
//
// public class Main {
//   public static void main(String[] args) {  …クラスブロック
//     System.out.println("RPG: スッキリ魔王征伐");  …メソッドブロック
//     System.out.println("Ver.0.1 by 湊");
//     System.out.println("＜ただいま鋭意学習・制作中＞");
//     System.out.println("プログラムを終了します");
//   }
//
//{}で囲まれた部分をブロックという。
//外側のブロックはクラスブロック、内側のブロックはメソッドブロック
//…必ず２重構造になる
//
//コンピュータに対する指示命令はメソッドブロックの中。最初の２行、最後の２行はあまり変わらない。
//※最初の２行はたまに変わる。
//public class の直後にはプログラムの名前を指定する単語を書く。クラス名といい大文字のアルファベットで始まるようにする。
//
//
//javaソースファイルの名前
//…javaのソースコードを記述したファイル（ソースファイル）を保存するときには、ファイルの名前は「クラス名.java」にしなければいけない。
//
