/* データ型

データ型…変数宣言に使う型。

-----------------------------------------------------------------------------------
整数を格納できる４つの型（byte,short,int,long）
例）
byte glasses; glasses = 2;
short age; age = 18;
int salary; salary = 152000;
long worldPeople; worldPeople = 6900000000l;


格納可能な整数の範囲/使用バイト
<byte> -128 ~ 127 /1バイト
<short> -32768 ~ 32767 /2バイト
<int> -2147483648 ~ 2147483647 /4バイト
<long>-9223372036854775808 ~ 9223372036854775807 /8バイト

基本的にintを良く使う。
-----------------------------------------------------------------------------------
小数を格納できる２つの型（float,double）
例）
float weight; weight = 67.5f;
double height; height = 171,2;

基本的にdoubleを良く使う。
厳密な計算が不得意なため、金額の計算にfloat,doubleを使用しない。
-----------------------------------------------------------------------------------
YES か NO を格納できるboolean型
本当か嘘かといった二者択一の情報を代入するための型。
肯定のtrue否定のfalseのどちらかの値のみ代入できる。
例）
boolean isError; isError = true;    エラーである。
boolean result; result = false;    結果は失敗である。
-----------------------------------------------------------------------------------
１文字だけ格納できるchar型、文字列が格納できるString型
char型は１文字のみ代入できる。
string型は０文字以上代入できる。
char zodiac; zodiac = '辰'；
String name; name = "すがはら"

１文字の時は''で括る。
*/