/*
練習1-1
javaでプログラムを開発するためには、「コンパイラ」と「インタプリタ」というソフトウェアが必要。
「コンパイラ」はjavaの文法に沿って記述した「ソースコード」を「バイトコード」に変換する。
「インタプリタ」は内部に「JVM」という仕組みを使いこれを解釈し、マシン語に変換してCPUに送りCPUは命令し実行する。
ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
練習1-2
public class Main {
   public static void main(String[] args) {
     int a = 3; int b = 5;
     int c = a * b;
     System.out.println("t縦幅３横幅５の長方形の面積は、" + c);
   }
}
ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
練習1-3
①  boolean result = true;
②  char favoriteCharacter = '駆'；
③  double pi = 3.14;
④  long number = 314159265853979L;
⑤  String msg = "ミナトの攻撃！敵に１５ポイントのダメージを与えた。 ";
ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
*/