/*エスケープシーケンス

…String型 char型のリテラルを記述する際に用いる。
¥記号と、それに続く１文字の合計２文字による記述方法で、その２文字で特殊な１文字を表す。

¥"…二重引用符記号 "
¥'…引用符記号 '
¥¥…円記号 ¥¥
¥n…改行
引用符記号や金額を画面に表す際に必要。

例）誤り
public class Main {
  public static void main(String[] args) {
    System.out.println("私の好きな記号は二重引用符（"）です");
  }
}

実行結果: コンパイルエラー
…２つの二重引用符に囲まれた部分を文字列リテラルとみなす。
そのため「私の好きな記号は二重引用符（」となり、エラーが発生する。

例）正しい
public class Main {
  public static void main(String[] args) {
    System.out.println("私の好きな記号は二重引用符（¥"）です");
  }
}

実行結果：私の好きな記号は二重引用符（"）です

金額を表示する
¥1200を表示したい。
¥¥1200と記述する。

*/