/*インクリメント/デクリメント演算子

  演算子 |    機能     |  優先順位 |  評価の方法  |            評価の例            |
   ++   | 値を１増やす |  最高(1)  |    左→右    | a++ → a (a=a+1 ,a += 1) と同じ |
   --   | 値を１減らす |  最高(1)  |    左→右    | a-- → a (a=a-1 ,a -= 1) と同じ |

public class Main {
  public static void main(String[] args) {
    int a;
    a = 100;
    a++;  …aの内容が１増える。(単純演算子)
    System.out.println(a);
  }
}
実行結果: 101
---------------------------------------------

++,--他の演算子と一緒に使わない。

インクリメント/デクリメント演算子は「++a」 のようにオペランドの前につけることもできる。
しかし他の演算子と一緒に利用すると「++a」「a++」では微妙な違いが生じる。

public class Main {
  public static void main(String[] args) {
    int a = 10;
    int b = 10;
    System.out.println(++a + 50);…⑤
    System.out.println(b++ + 50);…⑥
  }
}
実行結果：
61
60

⑤
①変数aの値が１増える。
②それに５０を加えたものが画面に表示される

⑥
①変数bに５０を加えたものが画面に表示される。
②変数bの値が１増える。

バグの原因になるため、他の演算子と一緒に利用しない。

 */